set names utf8;
drop database if exists pet;
create database pet charset=utf8;
use pet;

##创建 Login表
create table pet_login(
	id int primary key auto_increment,
	uname varchar(32) not null,
	upwd varchar(32) not null
);
##插入数据 Login
insert into pet_login(uname,upwd) values("13058531174",'lxc1234567'),("14714001226",'cgh1234567');

##创建宠物用品列表 
create table pet_supplies(
	id int primary key auto_increment, ##id
	pet varchar(32) not null,  ##什么宠物用品(猫或狗）
	brand varchar(32) not null,  ##品牌
	categories varchar(32) not null, ##类别
	img_url varchar(64) not null, ##图片地址
	products_name varchar(64) not null, ##商品名称
	products_describe varchar(64) not null, ##商品描述
	products_price float not null, ##商品价格
	products_original_price  float not null ##商品原价
);
##插入数据
insert into pet_supplies(pet,brand,categories,img_url,products_name,products_describe,products_price,products_original_price) 
values 
##伯纳天纯狗粮
("dog","伯纳天纯","宠粮","img/main_grain_03.png","伯纳天纯 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","伯纳天纯","宠粮","img/main_grain_04.png","伯纳天纯 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","伯纳天纯","宠粮","img/main_grain_03.png","伯纳天纯 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","伯纳天纯","宠粮","img/main_grain_04.png","伯纳天纯 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","伯纳天纯","宠粮","img/main_grain_03.png","伯纳天纯 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","伯纳天纯","宠粮","img/main_grain_04.png","伯纳天纯 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","伯纳天纯","宠粮","img/main_grain_03.png","伯纳天纯 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","伯纳天纯","宠粮","img/main_grain_04.png","伯纳天纯 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
##伯纳天纯猫粮
("cat","伯纳天纯","宠粮","img/main_grain_01.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","伯纳天纯","宠粮","img/main_grain_02.png","伯纳天纯 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","伯纳天纯","宠粮","img/main_grain_01.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","伯纳天纯","宠粮","img/main_grain_02.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
("cat","伯纳天纯","宠粮","img/main_grain_01.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","伯纳天纯","宠粮","img/main_grain_02.png","伯纳天纯 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","伯纳天纯","宠粮","img/main_grain_01.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","伯纳天纯","宠粮","img/main_grain_02.png","伯纳天纯 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
##冠能狗粮
("dog","冠能","宠粮","img/main_grain_03.png","冠能 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","冠能","宠粮","img/main_grain_04.png","冠能 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","冠能","宠粮","img/main_grain_03.png","冠能 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","冠能","宠粮","img/main_grain_04.png","冠能 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","冠能","宠粮","img/main_grain_03.png","冠能 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","冠能","宠粮","img/main_grain_04.png","冠能 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","冠能","宠粮","img/main_grain_03.png","冠能 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","冠能","宠粮","img/main_grain_04.png","冠能 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
##冠能猫粮
("cat","冠能","宠粮","img/main_grain_01.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","冠能","宠粮","img/main_grain_02.png","冠能 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","冠能","宠粮","img/main_grain_01.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","冠能","宠粮","img/main_grain_02.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
("cat","冠能","宠粮","img/main_grain_01.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","冠能","宠粮","img/main_grain_02.png","冠能 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","冠能","宠粮","img/main_grain_01.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","冠能","宠粮","img/main_grain_02.png","冠能 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
##皇家狗粮
("dog","皇家","宠粮","img/main_grain_03.png","皇家 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","皇家","宠粮","img/main_grain_04.png","皇家 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","皇家","宠粮","img/main_grain_03.png","皇家 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","皇家","宠粮","img/main_grain_04.png","皇家 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","皇家","宠粮","img/main_grain_03.png","皇家 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","皇家","宠粮","img/main_grain_04.png","皇家 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","皇家","宠粮","img/main_grain_03.png","皇家 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","皇家","宠粮","img/main_grain_04.png","皇家 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
##皇家猫粮
("cat","皇家","宠粮","img/main_grain_01.png","皇家 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","皇家","宠粮","img/main_grain_02.png","皇家 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","皇家","宠粮","img/main_grain_01.png","皇家 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","皇家","宠粮","img/main_grain_02.png","皇家 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
("cat","皇家","宠粮","img/main_grain_01.png","皇家 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","皇家","宠粮","img/main_grain_02.png","皇家 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","皇家","宠粮","img/main_grain_01.png","皇家 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","皇家","宠粮","img/main_grain_02.png","皇家沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
##巴西淘淘狗粮
("dog","巴西淘淘","宠粮","img/main_grain_03.png","巴西淘淘 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","巴西淘淘","宠粮","img/main_grain_04.png","巴西淘淘 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","巴西淘淘","宠粮","img/main_grain_03.png","巴西淘淘 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","巴西淘淘","宠粮","img/main_grain_04.png","巴西淘淘 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","巴西淘淘","宠粮","img/main_grain_03.png","巴西淘淘 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","巴西淘淘","宠粮","img/main_grain_04.png","巴西淘淘 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
("dog","巴西淘淘","宠粮","img/main_grain_03.png","巴西淘淘 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",398,529),
("dog","巴西淘淘","宠粮","img/main_grain_04.png","巴西淘淘 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",340,469),
##巴西淘淘猫粮
("cat","巴西淘淘","宠粮","img/main_grain_01.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","巴西淘淘","宠粮","img/main_grain_02.png","巴西淘淘 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","巴西淘淘","宠粮","img/main_grain_01.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","巴西淘淘","宠粮","img/main_grain_02.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
("cat","巴西淘淘","宠粮","img/main_grain_01.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",389,489),
("cat","巴西淘淘","宠粮","img/main_grain_02.png","巴西淘淘 金枪鱼马铃薯蔓月莓成猫粮 10KG","天然无谷低敏配方",340,469),
("cat","巴西淘淘","宠粮","img/main_grain_01.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",398,529),
("cat","巴西淘淘","宠粮","img/main_grain_02.png","巴西淘淘 沙丁鱼+紫薯 蔓越莓幼猫粮 10KG","天然无谷低敏配方",340,469),
##蒙贝零食
("dog","蒙贝","零食","img/snacks01.png","蒙贝 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","蒙贝","零食","img/snacks03.png","蒙贝 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","蒙贝","零食","img/snacks04.png","蒙贝 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("dog","蒙贝","零食","img/snacks02.png","蒙贝 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("dog","蒙贝","零食","img/snacks03.png","蒙贝 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","蒙贝","零食","img/snacks02.png","蒙贝 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","蒙贝","零食","img/snacks01.png","蒙贝 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","蒙贝","零食","img/snacks04.png","蒙贝 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
##猫
("cat","蒙贝","零食","img/snacks01.png","蒙贝 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","蒙贝","零食","img/snacks03.png","蒙贝 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","蒙贝","零食","img/snacks04.png","蒙贝 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,529),
("cat","蒙贝","零食","img/snacks02.png","蒙贝 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",34,46),
("cat","蒙贝","零食","img/snacks03.png","蒙贝 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","蒙贝","零食","img/snacks02.png","蒙贝 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","蒙贝","零食","img/snacks01.png","蒙贝 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","蒙贝","零食","img/snacks04.png","蒙贝 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
##日清零食
("dog","日清","零食","img/snacks01.png","日清 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","日清","零食","img/snacks03.png","日清 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","日清","零食","img/snacks04.png","日清 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("dog","日清","零食","img/snacks02.png","日清 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("dog","日清","零食","img/snacks03.png","日清 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","日清","零食","img/snacks02.png","日清 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","日清","零食","img/snacks01.png","日清 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","日清","零食","img/snacks04.png","日清 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
##猫
("cat","日清","零食","img/snacks01.png","日清 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","日清","零食","img/snacks03.png","日清 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","日清","零食","img/snacks04.png","日清 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,529),
("cat","日清","零食","img/snacks02.png","日清 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",34,46),
("cat","日清","零食","img/snacks03.png","日清 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","日清","零食","img/snacks02.png","日清 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","日清","零食","img/snacks01.png","日清 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","日清","零食","img/snacks04.png","日清 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
##巅峰零食
("dog","巅峰","零食","img/snacks01.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","巅峰","零食","img/snacks03.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","巅峰","零食","img/snacks04.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("dog","巅峰","零食","img/snacks02.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("dog","巅峰","零食","img/snacks03.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","巅峰","零食","img/snacks02.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","巅峰","零食","img/snacks01.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","巅峰","零食","img/snacks04.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
##猫
("cat","巅峰","零食","img/snacks01.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("cat","巅峰","零食","img/snacks03.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("cat","巅峰","零食","img/snacks04.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("cat","巅峰","零食","img/snacks02.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("cat","巅峰","零食","img/snacks03.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("cat","巅峰","零食","img/snacks02.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("cat","巅峰","零食","img/snacks01.png","巅峰 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("cat","巅峰","零食","img/snacks04.png","巅峰 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
#MAG营养品
("dog","MAG","营养品","img/bjp01.png","MAG 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","MAG","营养品","img/bjp02.png","MAG 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","MAG","营养品","img/bjp03.png","MAG 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("dog","MAG","营养品","img/bjp04.png","MAG 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("dog","MAG","营养品","img/bjp01.png","MAG 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","MAG","营养品","img/bjp02.png","MAG 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","MAG","营养品","img/bjp03.png","MAG 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","MAG","营养品","img/bjp04.png","MAG 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
##猫
("cat","MAG","营养品","img/bjp01.png","MAG 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","MAG","营养品","img/bjp02.png","MAG 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","MAG","营养品","img/bjp03.png","MAG 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,529),
("cat","MAG","营养品","img/bjp04.png","MAG 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",34,46),
("cat","MAG","营养品","img/bjp01.png","MAG 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","MAG","营养品","img/bjp02.png","MAG 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","MAG","营养品","img/bjp03.png","MAG 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","MAG","营养品","img/bjp04.png","MAG 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
#红狗营养品
("dog","红狗","营养品","img/bjp01.png","红狗 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","红狗","营养品","img/bjp02.png","红狗 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","红狗","营养品","img/bjp03.png","红狗 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,529),
("dog","红狗","营养品","img/bjp04.png","红狗 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",34,46),
("dog","红狗","营养品","img/bjp01.png","红狗 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","红狗","营养品","img/bjp02.png","红狗 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
("dog","红狗","营养品","img/bjp03.png","红狗 低敏无谷中大型成犬粮 15KG","天然无谷低敏配方",39,53),
("dog","红狗","营养品","img/bjp04.png","红狗 低敏无谷中大型幼犬粮 15KG","天然无谷低敏配方",27,46),
##猫
("cat","红狗","营养品","img/bjp01.png","红狗 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","红狗","营养品","img/bjp02.png","红狗 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","红狗","营养品","img/bjp03.png","红狗 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,529),
("cat","红狗","营养品","img/bjp04.png","红狗 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",34,46),
("cat","红狗","营养品","img/bjp01.png","红狗 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","红狗","营养品","img/bjp02.png","红狗 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46),
("cat","红狗","营养品","img/bjp03.png","红狗 低敏无谷中大型成猫粮 15KG","天然无谷低敏配方",39,53),
("cat","红狗","营养品","img/bjp04.png","红狗 低敏无谷中大型幼猫粮 15KG","天然无谷低敏配方",27,46);